testing_data/local_test_runs/bench_1000.txt
1000 records sent, 1000.000000 records/sec (0.38 MB/sec), 14.09 ms avg latency, 390.00 ms max latency, 2 ms 50th, 37 ms 95th, 40 ms 99th, 390 ms 99.9th.
producer-metrics:batch-size-avg:{client-id=perf-producer-client}                            : 1486.087
producer-metrics:bufferpool-wait-ratio:{client-id=perf-producer-client}                     : 0.000
producer-metrics:outgoing-byte-rate:{client-id=perf-producer-client}                        : 14414.413
producer-metrics:record-queue-time-avg:{client-id=perf-producer-client}                     : 0.700
producer-metrics:request-latency-avg:{client-id=perf-producer-client}                       : 2.129