testing_data/local_test_runs/bench_10000.txt
10000 records sent, 1000.100010 records/sec (0.38 MB/sec), 1.45 ms avg latency, 313.00 ms max latency, 1 ms 50th, 2 ms 95th, 15 ms 99th, 19 ms 99.9th.
producer-metrics:batch-size-avg:{client-id=perf-producer-client}                            : 943.797
producer-metrics:bufferpool-wait-ratio:{client-id=perf-producer-client}                     : 0.000
producer-metrics:outgoing-byte-rate:{client-id=perf-producer-client}                        : 116606.014
producer-metrics:record-queue-time-avg:{client-id=perf-producer-client}                     : 0.057
producer-metrics:request-latency-avg:{client-id=perf-producer-client}                       : 0.997