testing_data/local_test_runs/bench_100000.txt
100000 records sent, 1000.010000 records/sec (0.38 MB/sec), 0.98 ms avg latency, 357.00 ms max latency, 1 ms 50th, 1 ms 95th, 2 ms 99th, 16 ms 99.9th.
producer-metrics:batch-size-avg:{client-id=perf-producer-client}                            : 914.677
producer-metrics:bufferpool-wait-ratio:{client-id=perf-producer-client}                     : 0.000
producer-metrics:outgoing-byte-rate:{client-id=perf-producer-client}                        : 465967.121
producer-metrics:record-queue-time-avg:{client-id=perf-producer-client}                     : 0.025
producer-metrics:request-latency-avg:{client-id=perf-producer-client}                       : 0.918