testing_data/local_test_runs/bench_2000.txt
2000 records sent, 1000.000000 records/sec (0.38 MB/sec), 6.34 ms avg latency, 329.00 ms max latency, 1 ms 50th, 32 ms 95th, 36 ms 99th, 36 ms 99.9th.
producer-metrics:batch-size-avg:{client-id=perf-producer-client}                            : 1092.526
producer-metrics:bufferpool-wait-ratio:{client-id=perf-producer-client}                     : 0.000
producer-metrics:outgoing-byte-rate:{client-id=perf-producer-client}                        : 28695.457
producer-metrics:record-queue-time-avg:{client-id=perf-producer-client}                     : 0.231
producer-metrics:request-latency-avg:{client-id=perf-producer-client}                       : 1.388