testing_data/local_test_runs/bench_3000.txt
3000 records sent, 1000.000000 records/sec (0.38 MB/sec), 2.63 ms avg latency, 311.00 ms max latency, 1 ms 50th, 13 ms 95th, 19 ms 99th, 21 ms 99.9th.
producer-metrics:batch-size-avg:{client-id=perf-producer-client}                            : 1018.098
producer-metrics:bufferpool-wait-ratio:{client-id=perf-producer-client}                     : 0.000
producer-metrics:outgoing-byte-rate:{client-id=perf-producer-client}                        : 42057.058
producer-metrics:record-queue-time-avg:{client-id=perf-producer-client}                     : 0.098
producer-metrics:request-latency-avg:{client-id=perf-producer-client}                       : 1.124