testing_data/local_test_runs/bench_4000.txt
4000 records sent, 1000.000000 records/sec (0.38 MB/sec), 2.57 ms avg latency, 330.00 ms max latency, 1 ms 50th, 16 ms 95th, 22 ms 99th, 26 ms 99.9th.
producer-metrics:batch-size-avg:{client-id=perf-producer-client}                            : 997.463
producer-metrics:bufferpool-wait-ratio:{client-id=perf-producer-client}                     : 0.000
producer-metrics:outgoing-byte-rate:{client-id=perf-producer-client}                        : 54561.686
producer-metrics:record-queue-time-avg:{client-id=perf-producer-client}                     : 0.104
producer-metrics:request-latency-avg:{client-id=perf-producer-client}                       : 1.110