testing_data/local_test_runs/bench_5000.txt
5000 records sent, 1000.200040 records/sec (0.38 MB/sec), 3.65 ms avg latency, 382.00 ms max latency, 1 ms 50th, 29 ms 95th, 37 ms 99th, 40 ms 99.9th.
producer-metrics:batch-size-avg:{client-id=perf-producer-client}                            : 994.364
producer-metrics:bufferpool-wait-ratio:{client-id=perf-producer-client}                     : 0.000
producer-metrics:outgoing-byte-rate:{client-id=perf-producer-client}                        : 66337.409
producer-metrics:record-queue-time-avg:{client-id=perf-producer-client}                     : 0.125
producer-metrics:request-latency-avg:{client-id=perf-producer-client}                       : 1.141