testing_data/local_test_runs/bench_8000.txt
8000 records sent, 1000.000000 records/sec (0.38 MB/sec), 2.25 ms avg latency, 321.00 ms max latency, 1 ms 50th, 2 ms 95th, 34 ms 99th, 35 ms 99.9th.
producer-metrics:batch-size-avg:{client-id=perf-producer-client}                            : 955.722
producer-metrics:bufferpool-wait-ratio:{client-id=perf-producer-client}                     : 0.000
producer-metrics:outgoing-byte-rate:{client-id=perf-producer-client}                        : 98070.971
producer-metrics:record-queue-time-avg:{client-id=perf-producer-client}                     : 0.072
producer-metrics:request-latency-avg:{client-id=perf-producer-client}                       : 1.010